# KipFeetPerDegree Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KipFeetPerDegree Property
UnitTypeId Class See Also
---
Kip feet per degree.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipFeetPerDegree { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipFeetPerDegree As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipFeetPerDegree {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace